<?php
/*
 * User: keke
 * Date: 2018/4/22
 * Time: 16:03
 *——————————————————佛祖保佑 ——————————————————
 *                   _ooOoo_
 *                  o8888888o
 *                  88" . "88
 *                  (| -_- |)
 *                  O\  =  /O
 *               ____/`---'\____
 *             .'  \|     |//  `.
 *            /  \|||  :  |||//  \
 *           /  _||||| -:- |||||-  \
 *           |   | \\  -  /// |   |
 *           | \_|  ''\---/''  |   |
 *           \  .-\__  `-`  ___/-. /
 *         ___`. .'  /--.--\  `. . __
 *      ."" '<  `.___\_<|>_/___.'  >'"".
 *     | | :  ` - `.;`\ _ /`;.`/ - ` : | |
 *     \  \ `-.   \_ __\ /__ _/   .-` /  /
 *======`-.____`-.___\_____/___.-`____.-'======
 *                   `=---='
 *——————————————————代码永无BUG —————————————————
 */
//// Autoload 自动载入
define("ROOTPATH", __DIR__);
//require __DIR__ . '/vendor/autoload.php';
////var_dump(ROOTPATH);
//require __DIR__ . '/routes/routes.php';
require_once __DIR__ . '/vendor/autoload.php';
use Sapi\Sapi;

Sapi::run();
//\Sapi\Sapi::run();